In [ ]:
#Instala a biblioteca pandas
!pip install pandas

In [9]:
#Importa a biblioteca pandas
import pandas as pd

In [10]:
#Criando um dicionário
Dicionario = {
    'A':[1,2,3],
    'B':[-3,-2,-1],
    'C':[0,10,20]
}
Label = ['1ª Linha', '2ª Linha', '3ª Linha']
Dataframe_01= pd.DataFrame(Dicionario,index=Label)
print(Dataframe_01)

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [11]:
#Exibindo as colunas A e B
Dataframe_01[['A', 'B']]

          A  B
1ª Linha  1 -3
2ª Linha  2 -2
3ª Linha  3 -1

In [24]:
#Criando uma coluna nova no DataFrame
Dataframe_01['Nova Coluna'] = Dataframe_01['A'] * Dataframe_01['B']

In [25]:
Dataframe_01 #Exibe o DataFrame

          A  B   C  Nova Coluna
1ª Linha  1 -3   0           -3
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [29]:
# Exibindo os valores na saída da célula do notebook
a = 6
print(a) 
Dataframe_01

6

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [27]:
#Excluindo uma coluna 
#Drop exclui uma linha ou coluna do Dataframe
Dataframe_01.drop('Nova Coluna', axis = 1)

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [28]:
#Excluindo uma coluna definitivamente do DataFrame
Dataframe_01.drop('Nova Coluna',axis = 1, inplace=True)